<template>
  <div>
    <divider>投票规则</divider>
    <div>投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则投票规则</div>
    <divider></divider>
    <x-button type="primary" @click.native="access">我已阅读</x-button>
  </div>

</template>

<script type="text/ecmascript-6">
  import {XButton, Divider} from 'vux'

  export default {
    components: {
      XButton,
      Divider
    },
    methods:{
      access () {

      }
    }
  }

</script>

<style scoped>

</style>
